def intro():
    print("""========================================================================================
      🎉С Днем рождения!!🎉
Привет, Пап. Сегодня я подготовил для тебя небольшое представление в честь дня рождения 
Нажми на ENTER, чтобы продолжить.
========================================================================================""")
    input()

def first_scene():
    print("""=============================================
Перед тобой появилась подарочная коробка 🎁
Что бы ты хотел с ней сделать?
1. Открыть сразу
2. Потрясти коробку
=============================================""")


def last_scene():
    print("Last")


while True:
    print("""
1. Start
2. Exit""")
    try:
        command = int(input("> "))
    except ValueError:
        print("Incorrect value, try again")
        continue
    if command == 1:
        intro()
        first_scene()
        last_scene()
    elif command == 2:
        break
    else:
        print("Invalid command, try again")